# Brewfile
# Install with: brew bundle --file ./Brewfile

tap "homebrew/bundle"
tap "homebrew/cask-fonts"

brew "git"
brew "gh"
brew "tmux"
brew "starship"
brew "tree-sitter"
brew "eza"
brew "bat"
brew "fastfetch"
brew "fzf"
brew "btop"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "rcm"
brew "ripgrep"
brew "zellij"
brew "yazi"

brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-you-should-use"

brew "mas"

cask "font-maple-mono-nf"
